; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v1 - type_2)
 	      (pred_1 ?v8 - object ?v1 - type_2)
	      (pred_2 ?v3 - type_1 ?v5 - type_3)
	      (pred_4 ?v3 - type_1 ?v8 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v3 - type_1 ?v4 ?v7 - type_2)
       :precondition (and  (pred_3 ?v3 ?v4))
       :effect (and  (pred_3 ?v3 ?v7)
		     (not (pred_3 ?v3 ?v4))))

   (:action op_2
       :parameters (?v3 - type_1 ?v6 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v2) (pred_3 ?v3 ?v2) (pred_2 ?v3 ?v5))
       :effect (and (pred_4 ?v3 ?v6 ?v5)
		    (not (pred_1 ?v6 ?v2)) 
		    (not (pred_2 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_1 ?v6 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v5) (pred_3 ?v3 ?v2))
       :effect (and (pred_1 ?v6 ?v2)
		    (pred_2 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_12 - type_1
obj_06 obj_03 obj_01 obj_10 - type_3
obj_04 obj_08 obj_14 obj_05 - type_2
obj_07 obj_09 obj_13 obj_11 - object)
(:init
(pred_3 obj_02 obj_08)
(pred_2 obj_02 obj_06)
(pred_2 obj_02 obj_03)
(pred_3 obj_12 obj_04)
(pred_2 obj_12 obj_01)
(pred_2 obj_12 obj_10)
(pred_1 obj_07 obj_04)
(pred_1 obj_09 obj_05)
(pred_1 obj_13 obj_14)
(pred_1 obj_11 obj_04)
)
(:goal
(and
(pred_1 obj_07 obj_08)
(pred_1 obj_09 obj_04)
(pred_1 obj_13 obj_08)
(pred_1 obj_11 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_14)))
)
)

; plan
1. (op_2 obj_12 obj_11 obj_04 obj_10)
   deleted: (pred_1 obj_11 obj_04) (pred_2 obj_12 obj_10)
   added: (pred_4 obj_12 obj_11 obj_10)
   goals met: 0 of 4
2. (op_2 obj_12 obj_07 obj_04 obj_01)
   deleted: (pred_1 obj_07 obj_04) (pred_2 obj_12 obj_01)
   added: (pred_4 obj_12 obj_07 obj_01)
   goals met: 0 of 4
3. (op_1 obj_02 obj_08 obj_05)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_05)
   goals met: 0 of 4
4. (op_1 obj_12 obj_04 obj_08)
   deleted: (pred_3 obj_12 obj_04)
   added: (pred_3 obj_12 obj_08)
   goals met: 0 of 4
5. (op_2 obj_02 obj_09 obj_05 obj_03)
   deleted: (pred_1 obj_09 obj_05) (pred_2 obj_02 obj_03)
   added: (pred_4 obj_02 obj_09 obj_03)
   goals met: 0 of 4
6. (op_3 obj_12 obj_11 obj_08 obj_10)
   deleted: (pred_4 obj_12 obj_11 obj_10)
   added: (pred_1 obj_11 obj_08) (pred_2 obj_12 obj_10)
   goals met: 1 of 4
7. (op_3 obj_12 obj_07 obj_08 obj_01)
   deleted: (pred_4 obj_12 obj_07 obj_01)
   added: (pred_1 obj_07 obj_08) (pred_2 obj_12 obj_01)
   goals met: 2 of 4
8. (op_1 obj_02 obj_05 obj_04)
   deleted: (pred_3 obj_02 obj_05)
   added: (pred_3 obj_02 obj_04)
   goals met: 2 of 4
9. (op_3 obj_02 obj_09 obj_04 obj_03)
   deleted: (pred_4 obj_02 obj_09 obj_03)
   added: (pred_1 obj_09 obj_04) (pred_2 obj_02 obj_03)
   goals met: 3 of 4
10. (op_1 obj_12 obj_08 obj_14)
   deleted: (pred_3 obj_12 obj_08)
   added: (pred_3 obj_12 obj_14)
   goals met: 3 of 4
11. (op_2 obj_12 obj_13 obj_14 obj_10)
   deleted: (pred_1 obj_13 obj_14) (pred_2 obj_12 obj_10)
   added: (pred_4 obj_12 obj_13 obj_10)
   goals met: 3 of 4
12. (op_1 obj_12 obj_14 obj_08)
   deleted: (pred_3 obj_12 obj_14)
   added: (pred_3 obj_12 obj_08)
   goals met: 3 of 4
13. (op_3 obj_12 obj_13 obj_08 obj_10)
   deleted: (pred_4 obj_12 obj_13 obj_10)
   added: (pred_1 obj_13 obj_08) (pred_2 obj_12 obj_10)
   goals met: 4 of 4
